{
    "Communications Interfaces": [
        "The communication between the different parts of the system is important since they depend on each  other. However, in what way the communication is achieved is not important for the system and is  therefore handled by the underlying operating systems for both the mobile application and the web portal.  "
    ],
    "Functional Requirements": [
        "This section provides a detailed description of all inputs into and outputs from the system. It also gives a  description of the hardware, software and communication interfaces and provides basic prototypes of the  user interface.  ",
        "This section includes the requirements that specify all the fundamental actions of the software system.  ",
        "ID: FR1  TITLE: Download mobile application     DESC: A user should be able to download the mobile application through either an application store or  similar service on the mobile phone. The application should be free to download.   RAT: In order for a user to download the mobile application.   DEP: None  ",
        "ID: FR10  TITLE: Mobile application - Switch result view  DESC: A user should be able to switch between a map view and a list view for all search options.   RAT: In order for a user to switch between result views.  DEP: FR7, FR8  ",
        "ID: FR11  TITLE: Mobile application - Selecting the information link  DESC: A user should be able to select the information link, which is included on all result items. The link  will direct the user to an information page, which includes a picture of the restaurant, the restaurant name,  address, phone number, e-mail address, type of food, average price, restaurant description and a menu  with name, description and price of the different dishes.   RAT: In order to show information about the restaurants.  DEP: FR7, FR8  ",
        "ID: FR12  TITLE: Mobile application - Search by price  DESC: A user should be able to input a maximum and a minimum price range. The result is displayed in  a list view by default.  RAT: In order for a user to search by price.  DEP: FR8  ",
        "ID: FR13  TITLE: Mobile application - Search by destination  DESC: A user should be able to input a maximum and a minimum distance, according to his/her position.  By default the minimum distance is set to 0 km and the maximum to 10 km. The user should be able to  input a higher or lower maximum distance and a higher minimum distance than set by default. The result  is displayed in a map view by default.  RAT: In order for a user to search by destination.  DEP: FR7  ",
        "ID: FR14  TITLE: Accepted input for price and destination search  DESC:  Integers should be accepted as input when a user searches by price or destination. If the system  receives an invalid input the user should be informed and prompted to insert an accepted input.  RAT: In order for a user to search with valid input.  DEP: FR12, FR13  ",
        "ID: FR15  TITLE: Mobile application - Search by restaurant type  DESC: A user should be able to select a restaurant type in a given list as input. The result is displayed in a  map view by default.  RAT: In order for a user to search by restaurant type.  DEP: FR7  ",
        "ID: FR16  TITLE: Mobile application - Search by specific dish  DESC: A user should be able to select a specific dish in a given list as input. The result is displayed in a  map view by default.  RAT: In order for a user to search by specific dish.  DEP: FR7  ",
        "ID: FR17  TITLE: Mobile application - Free-text search  DESC: A user should be able to conduct a search by providing either restaurant name, restaurant  description, restaurant address, restaurant type or restaurant menu in the free-text search field. The result  is displayed in a map view by default.  RAT: In order for a user to search through the free-text search.  DEP: FR7  ",
        "ID: FR18  TITLE: Mobile application - No match found  DESC: If no match is found the user should be informed but kept on the search page in order to get the  possibility to conduct a new search right away.  RAT: In order for user to conduct a new search if no match is found.  DEP: FR5  ",
        "ID: FR19   TITLE: Mobile application - Sorting results   DESC: When viewing the results in a list, a user should be able to sort the results according to price,  distance, restaurant type, specific dish or restaurant name.    When sorting by restaurant name, specific dish or restaurant type the results should be ordered  alphabetically.    When sorting by price the results should be ordered from cheapest to most expensive.   When sorting by distance the results should be ordered from closets to furthest distance according  to the user’s position.   When the sort button for a specific search option is clicked, then the order should be reversed and ordered  in a descending matter. If the sort button is clicked again the order of the results should be reversed.  RAT: In order for a user to sort results in a list.  DEP: FR8  ",
        "ID: FR2   TITLE: Download and notify users of new releases   DESC: When a new/updated version or release of the software is released, the user should check for these  manually. The download of the new release should be done through the mobile phone in the same way as  downloading the mobile application.  RAT: In order for a user to download a new/updated release.  DEP: FR1  ",
        "ID: FR20   TITLE: Mobile application - Filtering results   DESC: When viewing the results in a list or a map, a user should be able to filter the results in a filtering  menu. The filtering options include:   increasing or decreasing the maximum distance    increasing or decreasing the maximum price   choosing a restaurant type   choosing a specific dish  When filtering the results, only the existing results shall be affected and a new search query should not be  sent.       RAT: In order for a user to filter results in a list or a map.  DEP: FR7, FR8  ",
        "ID: FR21   TITLE: Mobile application - Profile page  DESC: On the mobile application, a user should have a profile page. On the profile page a user can edit  his/her information, which includes the password, e-mail address and phone number. A user should also  be able to choose what language the mobile application should be set to. The different language choices  are Swedish, English, Spanish and French.   RAT: In order for a user to have a profile page on the mobile application.  DEP: FR1  ",
        "ID: FR3  TITLE: User registration - Mobile application  DESC: Given that a user has downloaded the mobile application, then the user should be able to register  through the mobile application. The user must provide user-name, password and e-mail address. The user  can choose to provide a regularly used phone number.  RAT: In order for a user to register on the mobile application.  DEP: FR1  ",
        "ID: FR4  TITLE: User log-in - Mobile application  DESC: Given that a user has registered, then the user should be able to log in to the mobile application.  The log-in information will be stored on the phone and in the future the user should be logged in  automatically.   RAT: In order for a user to register on the mobile application.  DEP: FR1, FR3  ",
        "ID: FR5   TITLE: Retrieve password   DESC: Given that a user has registered, then the user should be able to retrieve his/her password by e- mail.   RAT: In order for a user to retrieve his/her password.   DEP: FR1  ",
        "ID: FR6  TITLE: Mobile application - Search   DESC: Given that a user is logged in to the mobile application, then the first page that is shown should be  the search page. The user should be able to search for a restaurant, according to several search options.  The search options are Price, Destination, Restaurant type and Specific dish. There should also be a free- text search option. A user should be able to select multiple search options in one search.  RAT: In order for a user to search for a restaurant.  DEP: FR4  ",
        "ID: FR7  TITLE: Mobile application - Search result in a map view  DESC:    Search results can be viewed on a map. On the map, the relevant and closest restaurants according  to the user’s position are shown.    A specific pin will represent a specific restaurant location. On each pin there should be an  information link.    There should be maximally 100 results displayed. The map view should have a default zoom.    The map view should include a button that, when selected, should display different filtering  options in a filtering menu.   RAT: The way results are displayed in a map.  DEP: FR6  ",
        "ID: FR8  TITLE: Mobile application - Search result in a list view  DESC:    Search results can be viewed in a list. Each element in the list represents a specific restaurant.  Each element should include the restaurant name, telephone number, type of food, distance  according to the user’s position, average price, a short two-line description, a link to the  restaurant’s web-page and an information link.    There should be maximally 100 results displayed. If the result contains more restaurants than  what can be displayed on the screen at one time, the user should be able to scroll through them.    When searching by price the restaurants should be sorted according to the following order:   1. average price   2. distance   3. restaurant type  4. specific dish    When searching by a search option, other than price, the restaurants should be sorted according to  the following order:   1. distance   2. average price   3. restaurant type  4. specific dish    The list view should include a header with different selectable sorting options.   The list view should include a button that, when selected, should display different filtering  options in a filtering menu.   RAT: The way results should be displayed in a list.  DEP: FR6  ",
        "ID: FR9  TITLE: Mobile application - Navigation to restaurant  DESC: A user should be able to select a pin on a map or an element on a list. When a selection is made,  the location of the restaurant should be sent to the mobile phone’s GPS-navigation program. The user  should then be navigated to the destination. When the destination is reached, a user should be able to go  back to the search page on the mobile application.  RAT: To navigate a user to a chosen restaurant.  DEP: FR7, FR8  ",
        "ID: FR22  Feature: Create an account  In order to create an account  A restaurant owner  Should register on the web-portal  Scenario: Required information for registration  Given the restaurant owner wants to create an account  And the restaurant owner does not have an account  When the restaurant owner registers on the web-portal by providing user-name  And password  And address  And e-mail address  And phone number  Then the restaurant owner should be able to apply for verification     Scenario: Full information for registration   Given the restaurant owner wants to create an account  And the restaurant owner does not have an account  When the restaurant owner registers on the web-portal by providing user name  And password  And address  And e-mail address  And phone number  And mobile number  Then the restaurant owner should be able to apply for verification  Scenario: Confirmed registration  Given the restaurant owner has applied for verification  And has not received a confirmation e-mail after registration  When the restaurant owner receives a confirmation e-mail  Then the restaurant owner should be able to log in  ",
        "ID: FR23  Feature: Restaurant owner log-in  In order to use the system  A restaurant owner   Should be logged in to the web-portal  Scenario: Successful log-in  Given the restaurant owner wants to log in  When the restaurant owner logs in with his/her account  Then the restaurant owner should be logged in as a restaurant owner  Scenario: Retrieve password  Given the restaurant owner wants to log in  And has lost the password  When the restaurant owner enters his/her email address in the “Retrieve password” form  And submits the form  Then the restaurant owner should receive an email containing the password  ",
        "ID: FR24  Feature: Manage information  In order to manage information   A restaurant owner  Should be logged in to the web-portal  Scenario: Show fields for managing information  Given the restaurant owner is logged in  When the restaurant owner wants to manage information  Then the restaurant owner should be able to manage information in a form   Scenario: Filling in mandatory fields  Given the restaurant owner wants to fill in the mandatory fields of the form   When the restaurant owner provides average price  And address  And e-mail address  And phone number  And restaurant name  Then the restaurant owner has filled the mandatory fields of the form   Scenario: Filling in optional fields  Given the restaurant owner of a restaurant wants to fill in optional fields in the form  When the restaurant owner provides restaurant description  And menu   And type of restaurant   And picture of restaurant  And mobile phone  Then the restaurant owner has filled in optional fields in the form  Scenario: Filling in menu field  Given the restaurant owner wants to fill in the menu field in the form  When the restaurant owner provides dish name  And dish description  And dish price  Then the restaurant owner has filled in the menu field in the form  Scenario: Adding information with mandatory fields  Given the restaurant owner has filled in the mandatory fields of the form  When the restaurant owner submits the form  Then the information about the restaurant should be added  Scenario: Adding information with mandatory and optional fields  Given the restaurant owner has filled in the mandatory fields of the form  And filled in one or more optional fields of the form  When the restaurant owner submits the form  Then the information about the restaurant should be added  Scenario: Deleting information  Given the restaurant owner is logged in  And information exists  When the restaurant owner deletes information  Then the information should be deleted  Scenario: Editing information  Given the restaurant owner is logged in  And information exists   When the restaurant owner edits information  Then the information should be edited  ",
        "ID: FR25   Feature: Restaurant owner - Selecting preferred language on the web-portal  In order to understand the web-portal  A restaurant owner  Should be able to select a preferred language for the web-portal  Scenario: Select English as preferred language  Given the restaurant owner wants to select a preferred language  When the restaurant owner selects English as a new language   Then the web-portal will show all text in English  Scenario: Select Swedish as preferred language  Given the restaurant owner wants to select a preferred language  When the restaurant owner selects Swedish as a new language   Then the web-portal will show all text in Swedish  Scenario: Select French as preferred language  Given the restaurant owner wants to select a preferred language  When the restaurant owner selects French as a new language   Then the web-portal will show all text in French  Scenario: Select Spanish as preferred language  Given the restaurant owner wants to select a preferred language  When the restaurant owner selects Spanish as a new language   Then the web-portal will show all text in Spanish  ",
        "ID: FR26  Feature: Administrator log in  In order to administer the system  An administrator  Should be logged in to the web-portal  Scenario: Successful log-in  Given the administrator wants to log in  When the administrator logs in with an administrator account  Then the administrator should be logged in as an administrator  ",
        "ID: FR27  Feature: Verify restaurant owner  In order to allow a restaurant owner to use the system  An administrator  Should be able to verify the restaurant owner  Scenario: Verify a restaurant owner  Given the administrator is logged in  When the administrator verifies a restaurant owner  Then the restaurant owner should be able to log in  And the restaurant owner should be notified by a confirmation email  Scenario: Reject a restaurant owner  Given the administrator is logged in  When the administrator rejects a restaurant owner  Then the restaurant owner should not be able to log in  And the restaurant owner should be notified by a rejection email  ",
        "ID: FR28  Feature: Manage restaurant types  In order to have a list of restaurant types  An administrator  Should be able to manage the restaurant types  Scenario: Add a new restaurant type  Given the administrator is logged in  When the administrator creates a new restaurant type  Then the new restaurant type should be added to the list of restaurant types  Scenario: Editing an existing restaurant type  Given the administrator is logged in  When the administrator edits an existing restaurant type  Then the restaurant type should be updated in the list of restaurant types  Scenario: Delete a restaurant type  Given the administrator is logged in  When the administrator deletes a restaurant type  Then the deleted restaurant type should be removed from the list of restaurant types  ",
        "ID: FR29  Feature: Manage restaurant dishes  In order to have a list of dishes  An administrator  Should be able to manage the dishes  Scenario: Add a new dish  Given the administrator is logged in  When the administrator creates a new dish  Then the new dish should be added to the list of dishes  Scenario: Editing an existing dish  Given the administrator is logged in  When the administrator edits an existing dish  Then the dish should be updated in the list of dishes  Scenario: Delete a dish  Given the administrator is logged in  When the administrator deletes a dish  Then the deleted dish should be removed from the list of dishes  ",
        "ID: FR30  Feature: Manage restaurant information  In order to manage restaurant information   An administrator  Should be logged in to the web-portal  Scenario: Add restaurant information  Given the administrator is logged in  When the administrator adds restaurant information  Then the information should be added to the restaurant  Scenario: Delete restaurant information  Given the administrator is logged in  And information about a restaurant exists  When the administrator deletes the information  Then the information about the restaurant should be deleted  Scenario: Edit restaurant information  Given the administrator is logged in   And information about a restaurant exists  When the administrator edits the information  Then the information about the restaurant should be edited  ",
        "ID: FR31  Feature: Manage users  In order to keep track of the users  An administrator  Should be able to manage the users  Scenario: Edit an existing user’s information  Given the administrator is logged in  When the administrator edits an existing user  Then the user information should be updated  Scenario: Delete/Inactivate an existing user  Given the administrator is logged in  When the administrator deletes an existing user  Then the user should be deleted  ",
        "ID: FR32  Feature: Manage restaurant owners  In order to keep track of the restaurant owners  An administrator  Should be able to manage the restaurant owners  Scenario: Add a new restaurant owner  Given the administrator is logged in  When the administrator creates a new restaurant owner  Then the new restaurant owner should be added  Scenario: Edit an existing restaurant owner  Given the administrator is logged in  When the administrator edits an existing restaurant owner  Then the restaurant owner information should be updated  Scenario: Delete an existing restaurant owner  Given the administrator is logged in  When the administrator deletes an existing restaurant owner  Then the restaurant owner should be deleted  And the restaurant information should be deleted  ",
        "ID: FR33    Feature: Administrator - Selecting preferred language on the web-portal  In order to understand the web-portal  An administrator  Should be able to select a preferred language for the web-portal  Scenario: Select English as preferred language  Given the administrator wants to select a preferred language  When the administrator selects English as a new language   Then the web-portal will show all text in English  Scenario: Select Swedish as preferred language  Given the administrator wants to select a preferred language  When the administrator selects Swedish as a new language   Then the web-portal will show all text in Swedish  Scenario: Select French as preferred language  Given the administrator wants to select a preferred language  When the administrator selects French as a new language   Then the web-portal will show all text in French  Scenario: Select Spanish as preferred language  Given the administrator wants to select a preferred language  When the administrator selects Spanish as a new language   Then the web-portal will show all text in Spanish  ",
        "The requirements in this section provide a detailed specification of the user interaction with the software  and measurements placed on the system performance.    "
    ],
    "Hardware Interfaces": [
        "Since neither the mobile application nor the web portal have any designated hardware, it does not have  any direct hardware interfaces. The physical GPS is managed by the GPS application in the mobile phone  and the hardware connection to the database server is managed by the underlying operating system on the  mobile phone and the web server.  ",
        "This section includes the design constraints on the software caused by the hardware.   "
    ],
    "Performance Requirements": [
        "ID: QR1  TITLE: Prominent search feature  DESC: The search feature should be prominent and easy to find for the user.  RAT: In order to for a user to find the search feature easily.  DEP: none  ",
        "ID: QR2  TITLE: Usage of the search feature  DESC: The different search options should be evident, simple and easy to understand.  RAT: In order to for a user to perform a search easily.  DEP: none  ",
        "ID: QR3  TITLE: Usage of the result in the list view  DESC: The results displayed in the list view should be user friendly and easy to understand. Selecting an  element in the result list should only take one click.  RAT: In order to for a user to use the list view easily.  DEP: none  ",
        "ID: QR4  TITLE: Usage of the result in the map view  DESC: The results displayed in the map view should be user friendly and easy to understand. Selecting a  pin on the map should only take one click.  RAT: In order to for a user to use the map view easily.  DEP: none  ",
        "ID: QR5  TITLE: Usage of the information link  DESC: The information link should be prominent and it should be evident that it is a usable link.  Selecting the information link should only take one click.  RAT: In order to for a user to use the information link easily.  DEP: none  ",
        "ID: QR6  TAG: ResponseTime  GIST: The fastness of the search  SCALE: The response time of a search  METER: Measurements obtained from 1000 searches during testing.  MUST: No more than 2 seconds 100% of the time.  WISH: No more than 1 second 100% of the time.  ",
        "ID: QR8  TAG: SystemDependability  GIST: The fault tolerance of the system.  SCALE:  If the system loses the connection to the Internet or to the GPS device or the system gets some  strange input, the user should be informed.  METER: Measurements obtained from 1000 hours of usage during testing.  MUST: 100% of the time.  ",
        "ID: QR19  TITLE: Application extendibility  DESC: The application should be easy to extend. The code should be written in a way that it favors  implementation of new functions.  RAT: In order for future functions to be implemented easily to the application.  DEP: none  ID: QR21  TITLE: Application testability  DESC: Test environments should be built for the application to allow testing of the applications different  functions.  RAT: In order to test the application.  DEP: none  "
    ],
    "Security Requirements": [
        "The requirements in this section specify the required reliability, availability, security and maintainability  of the software system.  ",
        "ID: QR12  TAG: CommunicationSecurity  GIST: Security of the communication between the system and server.  SCALE: The messages should be encrypted for log-in communications, so others cannot get user-name  and password from those messages.  METER: Attempts to get user-name and password through obtained messages on 1000 log-in session  during testing.  MUST: 100% of the Communication Messages in the communication of a log-in session should be  encrypted.  Communication Messages: Defined: Every exchanged of information between client and server.  ID: QR13  TAG: RestaurantOwnerLoginAccountSecurity  GIST: Security of accounts.  SCALE:  If a restaurant owner tries to log in to the web portal with a non-existing account then the  restaurant owner should not be logged in. The restaurant owner should be notified about log-in failure.  METER: 1000 attempts to log-in with a non-existing user account during testing.  MUST: 100% of the time.  ID: QR14  TAG: AdminLoginAccountSecurity  GIST: Security of accounts.  SCALE:  If an admin tries to log in to the web portal with a non-existing account then the admin should  not be logged in. The admin should be notified about log-in failure.  METER: 1000 attempts to log-in with a non-existing user account during testing.  MUST: 100% of the time.  ID: QR15  TAG: RestaurantOwnerAccountSecurity  GIST: Security of restaurant owners accounts.  SCALE: A restaurant owner and IP address should not be able to log-in for a certain time period after  three times of failed log-in attempts.  METER: 1000 attempts to log-in during the lock period after user account has been locked because of  failed log-in attempts of three times.  MUST: The locking period should be half an hour, and during that period the log-in function is disabled.  ID: QR16  TAG: AdminAccountSecurity  GIST: Security of admin accounts.  SCALE: An admin and IP address should not be able to log-in to the web portal for a certain time period  after three times of failed log-in attempts.  METER: 1000 attempts to log-in during the lock period after user account has been locked because of  failed log-in attempts of three times.  MUST: The locking period should be half an hour, and during that period the log-in function is disabled.  ID: QR17  TAG: UserCreateAccountSecurity  GIST: The security of creating account for users of the system.  SCALE:  If a user wants to create an account and the desired user name is occupied, the user should be  asked to choose a different user name.  METER: Measurements obtained on 1000 hours of usage during testing.  MUST: 100% of the time.  ID: QR18  TAG: RestaurantOwnerCreateAccountSecurity  GIST: The security of creating account for restaurant owners of the system.  SCALE:  If a restaurant owner wants to create an account and the desired user name is occupied, the  restaurant owner should be asked to choose a different user name.  METER: Measurements obtained on 1000 hours of usage during testing.  MUST: 100% of the time.  "
    ],
    "Software Interfaces": [
        "The mobile application communicates with the GPS application in order to get geographical information  about where the user is located and the visual representation of it, and with the database in order to get the  information about the restaurants, see Figure 1. The communication between the database and the web  portal consists of operation concerning both reading and modifying the data, while the communication  between the database and the mobile application consists of only reading operations.  "
    ],
    "Software Quality Attributes": [
        "This section contains all of the functional and quality requirements of the system. It gives a detailed  description of the system and all its features.   ",
        "ID: QR10  TAG: HardDriveSpace  GIST: Hard drive space.  SCALE: The application’s need of hard drive space.  METER: MB.  MUST: No more than 20 MB.  PLAN: No more than 15 MB.  WISH: No more than 10 MB.  MB: DEFINED: Megabyte  ",
        "ID: QR11  TAG: ApplicationMemoryUsage  GIST: The amount of Operate System memory occupied by the application.  SCALE: MB.  METER: Observations done from the performance log during testing  MUST: No more than 20 MB.  PLAN: No more than 16 MB  WISH: No more than 10 MB  Operate System: DEFINED: The mobile Operate System which the application is running on.  MB: DEFINED: Megabyte.  ",
        "ID: QR9  TAG: SystemReliability  GIST: The reliability of the system.  SCALE:  The reliability that the system gives the right result on a search.  METER: Measurements obtained from 1000 searches during testing.  MUST: More than 98% of the searches.  PLAN: More than 99% of the searches.  WISH: 100% of the searches.  ",
        "ID: QR7  TAG: SystemAvailability  GIST: The availability of the system when it is used.  SCALE: The average system availability (not considering network failing).  METER: Measurements obtained from 1000 hours of usage during testing.  MUST: More than 98% of the time.  PLAN: More than 99% of the time.  WISH: 100% of the time.  ID: QR22  TITLE: Internet Connection  DESC: The application should be connected to the Internet.  RAT: In order for the application to communicate with the database.  DEP: none  ID: QR23  TITLE: GPS Connection  DESC: The application should be connected to the GPS device.  RAT: In order for the application to get the users location, the map and to calculate the distance.  DEP: none  ",
        "ID: QR20  TITLE: Application portability  DESC: The application should be portable with iOS and Android.  RAT: The adaptable platform for the application to run on.  DEP: none  "
    ],
    "User Interfaces": [
        "A first-time user of the mobile application should see the log-in page when he/she opens the application,  see Figure 2. If the user has not registered, he/she should be able to do that on the log-in page.  If the user is not a first-time user, he/she should be able to see the search page directly when the  application is opened, see Figure 3. Here the user chooses the type of search he/she wants to conduct.  Every user should have a profile page where they can edit their e-mail address, phone number and  password, see Figure 4. Also, the user can set the mobile application to his/her preferred language. The  “P” icon shows where the user can click to navigate to his/her profile page.  Figure 2 - Login page  Figure 3 – Search page  Figure 4 – Profile page  In Figure 5, the list view for the results is shown. When a user searches by price, this view should be the  default one. The sorting header allows the user to sort the results according to price, restaurant name,  distance, restaurant type and specific dish. Each result item includes information about the restaurants, a  link to the restaurant’s web-page and an information link, which provides a more detailed description of  the restaurant. There is also a filtering option, where the user can choose to filter the results by increasing  or decreasing the price or distance range, see Figure 7.   In the map view each restaurant is represented by a pin, see Figure 6. Next to every pin there is an  information link which provides a more detailed description of the restaurant, as mentioned for the list  view. The same filtering option, as for the list view, is included in the map view.    The restaurant owners and administrators interact with the system through a web-portal, see Figure 8. A  restaurant owner should be able to register on the web-portal in order to log in and manage the restaurant  information. An administrator should also be able to log in to the web-portal where he/she can administer  the system by for instance editing restaurant or user information.   Figure 5 – List view Figure 6 – Map view Figure 7 – Filter menu  Figure 8 – Web Portal  "
    ]
}