{"TC001 - BS#1 - Siebel - History Campaigns view - Accept from Pusula/NBA":"The purpose of the Test Case is to successfully validate in Siebel Pusula’s campaign response, when the operator clicks on \u0027accept\u0027 from Pusula tool. ","TC002 - BS#1 - Siebel - History Campaigns view - Decline from Pusula/NBA":"The purpose of the Test Case is to successfully validate in Siebel Pusula campaign response, when the operator clicks on \u0027Decline\u0027 from Pusula tool.","TC003 - BS#1 - Siebel - History Campaigns view - Answer Later from Pusula/NBA":"The purpose of the Test Case is to successfully validate in Siebel Pusula campaign response, when the operator clicks on \u0027Answer Later\u0027 from Pusula tool.","TC004 - BS#1 - Siebel - History Campaigns view – User without permission":"The purpose of the Test Case is to validate the restrictions on Customer History Campaigns view according to user profile.","TC005 - BS#1 - Siebel - History Campaigns view - Accept from Pusula/NBA- PRM":"The purpose of the Test Case is to successfully validate in PRM Customer History Campaigns view, when the operator clicks on \u0027Accept\u0027 from Pusula tool.","TC006 - BS#1 - Siebel - History Campaigns view - Decline from Pusula/NBA - PRM":"The purpose of the Test Case is to successfully validate in PRM Pusula campaign information, when the operator clicks on \u0027Decline\u0027 from Pusula tool.","TC007 - BS#1 - Siebel - History Campaigns view - Answer Later from Pusula/NBA - PRM":"The purpose of the Test Case is to successfully validate in PRM Pusula campaign information, when the operator clicks on \u0027Answer Later\u0027 from Pusula tool.","TC008 - BS#1 - Siebel - Campaigns List view - Accept from Call Center":"The purpose of the Test Case is to successfully validate the campaign response when a Call Center user accepts a campaign directly through Siebel in order to perform customer’s request.","TC009 - BS#1 - Siebel - Campaigns List view - Decline from Call Center":"The purpose of the Test Case is to successfully validate campaign information when a Call Center user declines a campaign directly through Siebel in order to perform customer’s request.","TC010 - BS#1 - Siebel - Campaigns List view - Call Center - Accept/Reject - Validate Campaign Status":"The purpose of the Test Case is to successfully validate the Campaign status on accept/reject a campaign when Call Center user accepts/rejects a campaign directly through Siebel in order to perform customer’s request.","TC011 - BS#1 - Siebel - Campaigns List view - Call Center - Accept - Validate Accepted/ Rejected/Requested Unsubscribe response":"The purpose of the Test Case is to successfully validate when a Call Center user clicks on accept button and a response already exists under the campaign.","TC012 - BS#1 - Siebel - Campaigns List view - Call Center - Reject - Validate Accepted/ Rejected/Requested Unsubscribe response":"The purpose of the Test Case is to successfully validate when a Call Center user clicks on reject button and a response already exists under the campaign.","TC013 - BS#1 - Siebel - Products Administration and Campaigns/Offers views - Validate Platform field":"The purpose of the Test Case is to validate Siebel Catalogue products available on the pick list on Campaigns/Offers views.","TC014 - BS#2 - CBU - Integration between PMS and OSM - Add Free Resource - SMS":"The purpose of the Test Case is to validate the integration between PMS (Promotion Management System) and OSM when adding Free Resource - SMS due PMS offer provisioning request for CBU customers.","TC015 - BS#2 - CBU - Integration between PMS and OSM - Add Free Resource - MMS":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Free Resource - MMS due PMS offer provisioning request for CBU customers.","TC016 - BS#2 - CBU - Integration between PMS and OSM - Add Free Resource - Air Time":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Free Resource - Air Time due PMS offer provisioning request for CBU customers.","TC017 - BS#2 - CBU - Integration between PMS and OSM - Add Free Resource - GPRS":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Free Resource - GPRS due PMS offer provisioning request for CBU customers.","TC018 - BS#2 - CBU - Integration between PMS and OSM - Add Invoice Discount":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Invoice Discount due PMS offer provisioning request for CBU customers.","TC019 - BS#2 - CBU - Integration between PMS and OSM - Add Option Discount - Bundle":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Option Discount - Bundle due PMS offer provisioning request for CBU customers.","TC020 - BS#2 - CBU - Integration between PMS and OSM - Add Option Discount - MAF - with Main product":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Option Discount due PMS offer provisioning request for CBU customers.","TC021 - BS#2 - CBU - Integration between PMS and OSM - Add Option Discount- without Main Product - Primary Offer":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Option Discount and Main Product due PMS offer provisioning request for CBU customers.","TC022 - BS#2 - CBU - Integration between PMS and OSM - Add Option Discount- without Main Product - Optional Offer ":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Option Discount and Main Product due PMS offer provisioning request for CBU customers.","TC023 - BS#2 - EBU - Integration between PMS and OSM - Add Free Resource - SMS - Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due offer provisioning request - Add free Resource- SMS for EBU customers.","TC024 - BS#2 - EBU - Integration between PMS and OSM - Add Free Resource - SMS - Customer Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due offer provisioning request - Add free Resource - SMS for EBU customers.","TC025 - BS#2 - EBU - Integration between PMS and OSM - Add Free Resource - MMS - Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due offer provisioning request - Add free Resource- MMS for EBU customers.","TC026 - BS#2 - EBU - Integration between PMS and OSM - Add Free Resource - MMS - Customer Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due offer provisioning request - Add free Resource-MMS for EBU customers.","TC027 - BS#2 - EBU - Integration between PMS and OSM - Add Free Resource - Air Time - Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due offer provisioning request - Add free Resource- Air Time for EBU customers.","TC028 - BS#2 - EBU - Integration between PMS and OSM - Add Free Resource - Air Time - Customer Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due offer provisioning request - Add free Resource - Air Time for EBU customers.","TC029 - BS#2 - EBU - Integration between PMS and OSM - Add Free Resource - GPRS":"The purpose of the Test Case is to validate the integration between PMS and OSM due offer provisioning request - Add free Resource- GPRS for EBU customers.","TC030 - BS#2 - EBU - Integration between PMS and OSM - Add Option Discount -Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Option Discount due PMS offer provisioning request for CBU customers.","TC031 - BS#2 - EBU - Integration between PMS and OSM - Add Option Discount - with Main product - Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Option Discount due PMS offer provisioning request for EBU customers.","TC032 - BS#2 - EBU - Integration between PMS and OSM - Add Option Discount- without Main Product - Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM when adding Option Discount and Main Product due PMS offer provisioning request for CBU customers.","TC033 - BS#2 - CBU - Integration between PMS and OSM - Remove Free Resource - SMS":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Free Resource- SMS for CBU customers.","TC034 - BS#2 - CBU - Integration between PMS and OSM - Remove Free Resource - MMS":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Free Resource- MMS for CBU customers.","TC035 - BS#2 - CBU - Integration between PMS and OSM - Remove Free Resource - Air time":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Free Resource- Air Time for CBU customers.","TC036 - BS#2 - CBU - Integration between PMS and OSM - Remove Free Resource - GPRS":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Free Resource- GPRS for CBU customers.","TC037 - BS#2 - CBU - Integration between PMS and OSM - Remove Invoice Discount":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Invoice Discount for CBU customers.","TC038 - BS#2 - CBU - Integration between PMS and OSM - Remove Option Discount- Bundle":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Optional Discount for CBU customers.","TC039 - BS#2 - CBU - Integration between PMS and OSM - Remove Main Product with Discount - Primary Offer":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Product and discount for CBU customers.","TC040 - BS#2 - CBU - Integration between PMS and OSM - Remove Main Product with Discount - Optional Offer":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Products and discount for CBU customers.","TC041 - BS#2 - EBU - Integration between PMS and OSM - Remove Free Resource - SMS - Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due removing free resource --SMS for EBU customers.","TC042 - BS#2 - EBU - Integration between PMS and OSM - Remove Free Resource - SMS - Customer Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due removing free resource --SMS removing free resource - SMS for EBU customers.","TC043 - BS#2 - EBU - Integration between PMS and OSM - Remove Free Resource - MMS - Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due removing free resource.","TC044 - BS#2 - EBU - Integration between PMS and OSM - Remove Free Resource - MMS - Customer Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due removing free resource - MMS for EBU customers.","TC045 - BS#2 - EBU - Integration between PMS and OSM - Remove Free Resource - Airtime - Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due removing free resource.","TC046 - BS#2 - EBU - Integration between PMS and OSM - Remove Free Resource - Airtime - Customer Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due removing free resource- Air Time for EBU customers.","TC047 - BS#2 - EBU - Integration between PMS and OSM - Remove Free Resource - GPRS":"The purpose of the Test Case is to validate the integration between PMS and OSM due removing free resource - GPRS for EBU customers.","TC048 - BS#2 - EBU - Integration between PMS and OSM - Remove Option Discount - Customer Non Cost Control":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Optional Discount for CBU customers.","TC049 - BS#2 - EBU - Integration between PMS and OSM - Remove Main Product with Option Discount":"The purpose of the Test Case is to validate the integration between PMS and OSM due Removing Main Product for EBU customers.","TC050 - BS#3 - Integration between Billing system (Kenan) and PMS - Invoice Generation/Invoice Payment/Invoice Cancelation":"The purpose of the Test Case is to validate the integration between Billing system (Kenan) and PMS related to customer eligibility for campaign.","TC051 - BS#4 - Channels - SMS - Validate Opt-in Collection and Autom. of platforms - With permission":"The purpose of the Test Case is to successfully validate Opt-in campaign from SMS channel. An Opt-in campaign asks users for their permission to launch any BTL campaign. Below The Line (BTL) campaigns use unconventional brand-building and promotional strategies, such as direct mail, sales promotions, flyers, point-of-sale, telemarketing etc.","TC052 - BS#4 - Channels - ICCB - Validate Opt-in Collection and Autom. of platforms - With permission":"The purpose of the Test Case is to successfully validate Opt-in campaign from ICCB (Innovative Customer Care and Billing) channel. An Opt-in campaign asks to users for their permission to launch any BTL campaign.","TC053 - BS#4 - Channels - SMS - Validate OptIn Collection and Autom. of platforms - Without permission":"The purpose of the Test Case is to successfully validate Opt-in campaign from SMS channel. An Opt-in campaign asks users for their permission to launch any BTL campaign.","TC054 - BS#4 - Channels - ICCB - Validate OptIn Collection and Autom. of platforms - Without permission":"The purpose of the Test Case is to successfully validate the Opt in to launch BTL campaign from ICCB channel.","TC055 - BS#4 - Channels - Campaigns from Pusula/NBA - Accept":"The purpose of the Test Case is to validate the integration from Pusula/NBA channel when customer accepts a campaign offer.","TC056 - BS#4 - Channels - Campaigns from Pusula/NBA - Decline":"The purpose of the Test Case is to validate the integration from Pusula/NBA channel when customer declines a campaign offer ","TC057 - BS#4 - Channels - Campaigns from Pusula/NBA - Answer later":"The purpose of the Test Case is to validate the integration from Pusula/NBA channel when customer defers a campaign offer.","TC058 - BS#4 - Channels - Campaign from SMS - Registration Based - Reply to SMS":"The purpose of the Test Case is to validate the integration from SMS channel when customer replies to SMS, on registration based campaign.","TC059 - BS#4 - Channels - Campaigns from SMS - Non - Registration Based":"The purpose of the Test Case is to validate the integration from Non- Registration Based campaign offer on SMS channel.","TC060 - BS#4 - Channels - Campaigns from SMS - Direct Load Campaigns":"The purpose of the Test Case is to validate the integration SMS channel on Direct Load Campaign.","TC061 - BS#4 - Channels - Campaigns from Inbound IVR - Accept":"The purpose of the Test Case is to validate the integration from Inbound IVR (Interaction Voice Respond) when customer accepts a campaign.","TC062 - BS#4 - Channels - Campaigns from Auto Dialer - Accept":"The purpose of the Test Case is to validate the integration from Auto Dialer when customer accepts a campaign.","TC063 - BS#4 - Channels - Campaigns from Auto Dialer - Validate SIEBEL Check Eligibility for Campaign":"The purpose of the Test Case is to validate the integration when Auto Dialer runs SIEBEL Check Eligibility for Campaign and the Flag \u0027User Private Data Acceptance\u0027 is unset.","TC064 - BS#4 - Channels - Campaigns from Auto Dialer - Validate Invoice Payment Status Inquiry":"The purpose of the Test Case is to validate the integration when Auto Dialer runs Invoice Payment Status Inquiry process for Campaign and open invoices are returned.","TC065 - BS#4 - Channels - Campaigns from Auto Dialer - Validate Black\u0026Grey List Inquiry":"The purpose of the Test Case is to validate the integration when Auto Dialer runs Black\u0026Grey List Inquiry process for Campaign and customer is in black/Grey list.","TC066 - BS#4 - Channels - Campaigns from Outbound CC - CCRM - accept":"The purpose of the Test Case is to successfully validate the integration when a campaign from CCRM (Call Center Resource Management) is accepted from subscriber.","TC067 - BS#4 - Channels - Automatic Letters - Generate the export list":"The purpose of the Test Case is to successfully generate on Siebel Marketing the export list that will be used by the legacy systems.","TC068 - BS#5 - Register Campaigns - Channels - Subscribe promotion with Charge - Accept":"The purpose of the Test Case is to successfully validate the Campaign registration with charge due subscriber acceptance.","TC069 - BS#5 - Register Campaigns - Channels - Subscribe promotion without Charge - Accept":"The purpose of the Test Case is to successfully validate the Campaign registration without charge, due subscriber acceptance.","TC070 - BS#5 - Register Campaigns - Channels - Subscribe promotion without Charge - Reject":"The purpose of the Test Case is to successfully validate the Campaign registration when customer rejects a campaign.","TC071 - BS#5 - Register Campaigns - Channels - Subscribe promotion without Charge - Deferred":"The purpose of the Test Case is to successfully validate the Campaign registration when customer defers a campaign.","TC072 - BS#5 - Register Campaigns - Channels - Unsubscribe promotion with Charge":"The purpose of the Test Case is to successfully validate the interface Unsubscribe promotion when charge operation fails on campaign registration.","TC073 - BS#5 - Register Campaigns - Channels - Direct promotion with Charge":"The purpose of the Test Case is to successfully validate the Campaign registration with charge on direct promotion.","TC074 - BS#5 - Register Campaigns - Channels - Direct promotion without Charge":"The purpose of the Test Case is to successfully validate the Campaign registration without charge on direct load promotion.","Test Name":"Test Description"}